Extensions/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВестиРасчетыПоДоговорам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоДокументам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВестиУчетОплатыПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПокупателяРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаАвансовПоставщикуРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПокупателемРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСПоставщикомРегл</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоговорПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb5f6678-4158-4ee5-8fcb-5d1c6c1cc651">
    <name>Регион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7122d071-c81b-484d-974a-5395bce9e1e5">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5466e60d-3f3b-4854-8bc4-fe713678faf2">
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="458d6d7c-5c88-45b8-888f-4d270608a318">
    <name>ПересчитатьКоличество</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec4ed95c-1f1d-4935-9318-2b9974ec88f0">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4c668625-cb13-4bde-bae0-9759ff1df43c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="854ddbe5-0bf2-4200-99b7-e7f1ddfc9a9f">
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f2371825-a31d-415b-8866-8e1c4f108e47">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="98a3a104-c023-42c2-a3c0-d21a8e8f0304">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41b066d1-5b7a-43b3-a41f-e1454f08da07">
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0565ba91-4e56-4a4c-9e27-ac8d883651da">
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="41d21375-fd54-4079-bbc2-300777a9d765">
    <name>ЯвляетсяНеРезидентом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="659f6c35-8c2c-4875-b5cb-8ac72af650b4">
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2539e2b6-2cb7-41c5-8e5d-9974cf014a38">
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf75569-7170-46ea-98a4-29bb3969c1c2">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1fc7846e-c92e-4119-9b0b-ab25f1a6447b">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7abf59d6-06a4-45fa-b1d0-bf469f93bc01">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="847a0096-60ac-48f8-8aca-cbe9c6b9d831">
    <name>ВидВыдачиНДФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dcd64d96-d03a-453f-9b38-c9fb1774f698">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bffaa0c1-d082-4cef-bb60-629a5f7c83bf">
    <name>ИсточникПривлеченияПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="150ea83f-859a-4383-a7e2-add9615c515d">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76824394-0205-4f78-811e-ec0d061e9082">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80bc655a-d926-42fc-b027-e9e0c125aff4">
    <name>СтатьяДДСПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4bd3ecda-70e1-4a95-8164-e47939295eac">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89cb84cb-9e1e-453c-8713-90ca48083f56">
    <name>AzRyОрганизацияПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="97d34945-57be-4c10-8ebe-f99f645f7f21">
    <name>ТранспортныеСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4ba6fe2e-1665-4ebc-a9ca-2fc497fa8096">
      <name>ТранпсортноеСедство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="bdad0c95-0a6d-4755-a02b-e7b01def2cc9">
    <name>AzRyKYCАнкетаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="db6504ac-39b9-4ffe-b0cb-6e2ddd912856">
      <name>Вопрос</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="969c130d-b763-4d98-b044-7238fd2376c3">
      <name>Ответ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="82020433-f8a7-4e23-b34a-13fe6dd56f97">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>250</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="fa81535a-911f-42fb-92a8-88eb7a2103db">
    <name>AzRyОценкаРискаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f3b8cc7b-e7df-41a9-8a4a-c3d0ae1cae2b">
      <name>Вопрос</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b5a4c161-918e-4341-ae1c-a9c60289f4b4">
      <name>Ответ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b5f0385a-e18f-49ac-b01f-ac85c3a27a23">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>250</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="5ab7326e-1d26-42b8-84ec-ce160831942c">
    <name>AzRyРискМатрицаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="7aeab778-b059-411e-8171-c588b1c39063">
      <name>ФакторРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e96ddf40-07c2-4d7b-a231-df498affa9ef">
      <name>ВероятностьРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4a3c4948-8048-429d-b0f9-ce88f0c2c947">
      <name>УровеньРиска</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e0ad8fa9-340f-4db3-a396-99b41e6da556">
      <name>МитигирующиеМеры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Extensions/src/Enums/ВидыКонтрагентов/ВидыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b6b4b04e-11e1-4863-abd0-935b3b246198">
  <name>ВидыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="cbb74a99-a3de-4a04-b39c-0c5fdfc6a1b0">
    <name>ГосударственныйОрган</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f1df639b-d0d6-4c5a-be9f-fe40514bb507">
    <name>ЮридическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="473e170d-f298-4de8-aa08-bb00f5100100">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="443de79e-3c1d-4498-b53e-77ce4b2a5167">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Enums/ВариантыУказанияКПП/ВариантыУказанияКПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыУказанияКПП</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПриПеречисленииНалогов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВоВсехПлатежныхПоручениях</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Extensions/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем ОрганизацияAzRyPay;

#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура РасшAzRy_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	УстановитьВидимостьKYCБлоков();	
	
КонецПроцедуры

// Обработчик события перед записью объекта.
//
// Проверяет заполненность обязательных реквизитов при создании нового контрагента.
// Если обязательные данные не заполнены, отменяет запись и открывает форму
// ввода данных контрагента с передачей текущих значений и параметров записи.
//
// Параметры:
//  Отказ - Булево - Признак отмены записи.
//  ПараметрыЗаписи - Структура - Параметры выполнения записи.
//
&НаКлиенте
Процедура РасшAzRy_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	Если НужноОткрыватьФормуДополнительныхДанныхКонтрагента() И Объект.Ссылка.Пустая() Тогда
		
		НаименованиеНеЗаполнено = Не ЗначениеЗаполнено(Объект.Наименование) Или Не ЗначениеЗаполнено(Объект.НаименованиеПолное);
		ИНННеЗаполнен = Не ЗначениеЗаполнено(Объект.ИНН);
		ДокументНеЗаполнен = ЭтоФизическоеЛицо() И Не ЗначениеЗаполнено(Объект.ДокументУдостоверяющийЛичность);		
		
		Если НаименованиеНеЗаполнено Или ИНННеЗаполнен Или ДокументНеЗаполнен Тогда
			
			Отказ = Истина; // отменяем текущую запись
			
			ПараметрыОткрытия = Новый Структура();
			ПараметрыОткрытия.Вставить("Наименование", Объект.Наименование);
			ПараметрыОткрытия.Вставить("Компания", Объект.НаименованиеПолное);
			ПараметрыОткрытия.Вставить("ИНН", Объект.ИНН);
			ПараметрыОткрытия.Вставить("ДокументУдостоверяющийЛичность", Объект.ДокументУдостоверяющийЛичность);
			ПараметрыОткрытия.Вставить("ДанныеКонтактныхЛиц", ДанныеКонтактныхЛиц);
			ПараметрыОткрытия.Вставить("КонтактнаяИнформация", ЭтаФорма.КонтактнаяИнформация);
			ПараметрыОткрытия.Вставить("Объект", Объект);
			ПараметрыОткрытия.Вставить("Ключ", Объект.Ссылка);			
			ПараметрыОткрытия.Вставить("ВидКонтрагента", Объект.ВидКонтрагента);
			ПараметрыОткрытия.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
			
			// передаём параметры записи в колбэк
			Оповещение = Новый ОписаниеОповещения("ОбработкаРезультатаФормыВводаДанных", ЭтотОбъект, ПараметрыЗаписи); 
			
			ОткрытьФорму("Справочник.Контрагенты.Форма.AzRyФормаВводаДанныхКонтрагента", 
			Новый Структура("ПараметрыОткрытия", ПараметрыОткрытия),
			ЭтотОбъект,
			,,,
			Оповещение,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Возврат;			
			
		КонецЕсли; 		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасшAzRy_ПриЗаписиНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.AzRyДанныеДляЗаписи) Тогда
		
		Попытка
			ЗаписатьДанныеОсновнаяОрганизация(ТекущийОбъект, ЭтотОбъект.AzRyДанныеДляЗаписи.Организация);
			ЗаписатьДанныеБанкСчет(ТекущийОбъект, ЭтотОбъект.AzRyДанныеДляЗаписи.БанковскиСчет);
		Исключение
			Отказ = Истина;
			Сообщить(ОписаниеОшибки(), СтатусСообщения.Важное);
		КонецПопытки;	
		
		ЭтотОбъект.AzRyДанныеДляЗаписи.ЭтоНовыйОбъект = Ложь;	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ПриОткрытииПосле(Отказ)
	
	ОрганизацияAzRyPay = ПолучитьОрганизациюAzRyPay();
	
	//ЗаполнитьТаблицуВопросов("AzRyKYCАнкетаКлиента", "AzRyВопросыKYCАнкетыКлиента");
	//ЗаполнитьТаблицуВопросов("AzRyОценкаРискаКлиента", "AzRyKYCВопросыКлиента");
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	//Элементы.ДокументУдостоверяющийЛичность.Видимость = ЭтоФизическоеЛицо();	
	
	Если ОрганизацияAzRyPay = ПолучитьОрганизациюПоУмолчанию() Тогда
		Элементы.AzRyKYCАнкетаКлиента.Видимость = Истина;
		Элементы.AzRyОценкаРискаКлиента.Видимость = Истина;
		Элементы.AzRyРискМатрицаКлиента.Видимость = Истина;
		//ЗаполнитьТаблицуВопросов("AzRyKYCАнкетаКлиента", "AzRyВопросыKYCАнкетыКлиента", "Вопрос");
		//ЗаполнитьТаблицуВопросов("AzRyОценкаРискаКлиента", "AzRyKYCВопросыКлиента", "Вопрос");
		//ЗаполнитьТаблицуВопросов("AzRyРискМатрицаКлиента", "AzRyФакторыРискаКлиента", "ФакторРиска");
	Иначе	
	    Элементы.AzRyKYCАнкетаКлиента.Видимость = Ложь;
		Элементы.AzRyОценкаРискаКлиента.Видимость = Ложь;
		Элементы.AzRyРискМатрицаКлиента.Видимость = Ложь;
		//ОчиститьТаблицуВопросов("AzRyKYCАнкетаКлиента");
		//ОчиститьТаблицуВопросов("AzRyОценкаРискаКлиента");
		//ОчиститьТаблицуВопросов("AzRyРискМатрицаКлиента");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункции

// Определяет, является ли текущий контрагент физическим лицом.
//
// Возвращаемое значение:
//  Булево - Истина, если вид контрагента "ФизическоеЛицо".
//
&НаКлиенте
Функция ЭтоФизическоеЛицо()

	//Возврат Объект.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	Возврат Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо");

КонецФункции

&НаСервере
Процедура УстановитьВидимостьKYCБлоков()

	ПоказыватьKYCБлоки = KYCДанныеЗаполнены();
	
	Элементы.AzRyKYCАнкетаКлиента.Видимость = ПоказыватьKYCБлоки;
	Элементы.AzRyОценкаРискаКлиента.Видимость = ПоказыватьKYCБлоки;
	Элементы.AzRyРискМатрицаКлиента.Видимость = ПоказыватьKYCБлоки;

КонецПроцедуры

&НаСервере
Функция KYCДанныеЗаполнены()

	Возврат
		Объект.AzRyKYCАнкетаКлиента.Количество() > 0
		Или Объект.AzRyОценкаРискаКлиента.Количество() > 0
		Или Объект.AzRyРискМатрицаКлиента.Количество() > 0;

КонецФункции

&НаСервере
Функция ПолучитьОрганизациюAzRyPay()

	Возврат Константы.AzRyОрганизацияAzRyPay.Получить();	

КонецФункции

&НаСервере
Функция НужноОткрыватьФормуДополнительныхДанныхКонтрагента()

	Возврат Константы.AzRyОткрыватьФормуДополнительныхДанныхКонтрагента.Получить();	

КонецФункции

&НаСервере
Функция ПолучитьОрганизациюПоУмолчанию()

	Возврат Объект.AzRyОрганизацияПоУмолчанию.Организация;	

КонецФункции

//&НаСервере
//Функция ПолучитьОсновнаяОрганизация(КонтрагентОрганизации)

//	Возврат КонтрагентОрганизации.Организация;	

//КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуВопросов(ИмяТабличнойЧасти, ПеречислениеВопросовТекст, Колонка)
	
	ПеречислениеВопросов = Перечисления[ПеречислениеВопросовТекст];
	
	ТаблицаВопросов = Объект[ИмяТабличнойЧасти];
	
	Для Каждого Вопрос Из ПеречислениеВопросов Цикл
		
		Если Не ВопросУжеЕсть(ТаблицаВопросов, Вопрос, Колонка) Тогда
			НоваяСтрока = ТаблицаВопросов.Добавить();
			НоваяСтрока[Колонка] = Вопрос;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВопросУжеЕсть(Таблица, Вопрос, Колонка)

	Для Каждого Стр Из Таблица Цикл
		
		Если Стр[Колонка] = Вопрос Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;

	Возврат Ложь;

КонецФункции

#КонецОбласти

#Область ОбработчикиОповещений

// Обрабатывает результат работы формы ввода данных контрагента.
//
// Заполняет реквизиты объекта данными, полученными из формы,
// переносит табличные данные на сервер и повторно инициирует запись.
//
// Параметры:
//  Результат - Структура - Результат закрытия формы ввода данных.
//  ПараметрыЗаписи - Структура - Параметры выполнения записи.
//
&НаКлиенте
Процедура ОбработкаРезультатаФормыВводаДанных(Результат, ПараметрыЗаписи) Экспорт
    	
	Если Результат <> Неопределено Тогда
		
		Объект.Наименование = Результат.ПоляДляЗаполнения.Наименование;
		Объект.НаименованиеПолное = Результат.ПоляДляЗаполнения.Компания;
		Объект.ИНН = Результат.ПоляДляЗаполнения.ИНН;
		Объект.ВидКонтрагента = Результат.ПоляДляЗаполнения.ВидКонтрагента;
		Объект.НалогообложениеНДС = Результат.ПоляДляЗаполнения.НалогообложениеНДС; 
		Объект.ДокументУдостоверяющийЛичность = Результат.ПоляДляЗаполнения.ДокументУдостоверяющийЛичность;
		ЭтотОбъект.AzRyДанныеДляЗаписи = Результат.ПоляДляЗаполнения; 
		
		ЗаполнитьДанныеИзФормыНаСервере(Результат.ПоляДляЗаполнения);
		
		// Повторно запускаем запись с теми же параметрами
		Записать(Результат);		
		
	КонецЕсли;
	
	Если Объект.AzRyKYCАнкетаКлиента.Количество() > 0 Или Объект.AzRyОценкаРискаКлиента.Количество() > 0 Или Объект.AzRyРискМатрицаКлиента.Количество() > 0 Тогда
		Элементы.AzRyKYCАнкетаКлиента.Видимость = Истина;
		Элементы.AzRyОценкаРискаКлиента.Видимость = Истина;
		Элементы.AzRyРискМатрицаКлиента.Видимость = Истина;
	КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти

#Область СервернаяЛогика

// Заполняет данные объекта из структуры полей, полученной из формы.
//
// Выполняет перенос контактной информации и контактных лиц,
// после чего обновляет элементы формы контактных лиц.
//
// Параметры:
//  ПоляДляЗаполнения - Структура - Данные, полученные из формы ввода.
//
&НаСервере
Процедура ЗаполнитьДанныеИзФормыНаСервере(ПоляДляЗаполнения)

	ЗаполнитьКонтактнуюИнформациюИзДанныхФормы(ПоляДляЗаполнения.КонтактнаяИнформация);
	ЗаполнитьКонтактныхЛицИзДанныхФормы(ПоляДляЗаполнения.ДанныеКонтактныхЛиц);	
	ЗаполнитьKYCОтветы(ПоляДляЗаполнения.AzRyKYCАнкетаКлиента, ПоляДляЗаполнения.AzRyОценкаРискаКлиента, ПоляДляЗаполнения.AzRyРискМатрицаКлиента);
	ОбновитьЭлементыКонтактныхЛиц();
	
КонецПроцедуры
 
// Заполняет контактную информацию объекта из коллекции данных формы.
//
// Перед загрузкой очищает текущую контактную информацию объекта.
//
// Параметры:
//  ДанныеФормыКоллекция - ДанныеФормыКоллекция - Коллекция данных формы
//      с контактной информацией.
//
&НаСервере
Процедура ЗаполнитьКонтактнуюИнформациюИзДанныхФормы(ДанныеФормыКоллекция)
	
	ЭтотОбъект.КонтактнаяИнформация.Очистить();
	ТЗ = ДанныеФормыВЗначение(ДанныеФормыКоллекция, Тип("ТаблицаЗначений"));
	ЭтотОбъект.КонтактнаяИнформация.Загрузить(ТЗ);
	
КонецПроцедуры

// Заполняет контактных лиц из коллекции данных формы.
//
// Для каждого контактного лица создает новую строку и переносит
// связанную контактную информацию.
//
// Параметры:
//  ДанныеФормыКоллекция - ДанныеФормыКоллекция - Коллекция данных формы
//      с контактными лицами.
//
&НаСервере
Процедура ЗаполнитьКонтактныхЛицИзДанныхФормы(ДанныеФормыКоллекция)
	
	ДанныеКонтактныхЛиц.Очистить();
	ТЗ = ДанныеФормыВЗначение(ДанныеФормыКоллекция, Тип("ТаблицаЗначений"));
	Для каждого СтрокаКонтактногоЛица  Из ТЗ Цикл
		
		НоваяСтрока = ДанныеКонтактныхЛиц.Добавить();
		НоваяСтрока.Наименование = СтрокаКонтактногоЛица.Наименование;
		ТЗКонтактнаяИнформация = СтрокаКонтактногоЛица.КонтактнаяИнформация;
		
		Для каждого СтрокаКонтактнойИнформации Из ТЗКонтактнаяИнформация Цикл
			
			НоваяЗапись = НоваяСтрока.КонтактнаяИнформация.Добавить();			
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаКонтактнойИнформации);
		
		КонецЦикла;
	
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьKYCОтветы(ДанныеФормыКоллекция1, ДанныеФормыКоллекция2, ДанныеФормыКоллекция3)
	
	Объект.AzRyKYCАнкетаКлиента.Очистить();
	Для каждого СтрокаKYCОтвет Из ДанныеФормыКоллекция1 Цикл
		
		НоваяЗапись = Объект.AzRyKYCАнкетаКлиента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаKYCОтвет);
	
	КонецЦикла;
	
	Объект.AzRyОценкаРискаКлиента.Очистить();
	Для каждого СтрокаKYCОтвет Из ДанныеФормыКоллекция2 Цикл
		
		НоваяЗапись = Объект.AzRyОценкаРискаКлиента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаKYCОтвет);
		
	КонецЦикла;
	
	Объект.AzRyРискМатрицаКлиента.Очистить();
	Для каждого СтрокаKYCОтвет Из ДанныеФормыКоллекция3 Цикл
		
		НоваяЗапись = Объект.AzRyРискМатрицаКлиента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаKYCОтвет);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеБанкСчет(ТекущийОбъект, БанковскиСчет)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();	
	НовыйСчет.НомерСчета = БанковскиСчет.НомерСчета;
	НовыйСчет.Владелец   = ТекущийОбъект.Ссылка;
	НовыйСчет.Банк = БанковскиСчет.БанкСчета;
	//НовыйСчет.БанкРасчетов = НовыйБанкКорр.Ссылка;
	НовыйСчет.ВариантУказанияКПП = Перечисления.ВариантыУказанияКПП.ВоВсехПлатежныхПоручениях;
	НовыйСчет.ВидСчета = "Расчетный";
	НовыйСчет.ВалютаДенежныхСредств = БанковскиСчет.ВалютаСчета;
	НовыйСчет.Записать();
	
	ТекущийОбъект.БанковскийСчетПоУмолчанию = НовыйСчет.Ссылка;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеОсновнаяОрганизация(ТекущийОбъект, ОрганизацияПоУмолчанию)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыйОрганизацияПУ = Справочники.AzRyКонтрагентОрганизации.СоздатьЭлемент();	
	НовыйОрганизацияПУ.Организация = ОрганизацияПоУмолчанию;
	НовыйОрганизацияПУ.Владелец = ТекущийОбъект.Ссылка;
	НовыйОрганизацияПУ.Наименование = ОрганизацияПоУмолчанию.Наименование;
	НовыйОрганизацияПУ.Записать();                   
	
	ТекущийОбъект.AzRyОрганизацияПоУмолчанию = НовыйОрганизацияПУ.Ссылка;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшAzRy_ОбработкаОповещенияПеред(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановкаОсновнойОрганизации" И Параметр.Контрагент = Объект.Ссылка Тогда
		
		Объект.AzRyОрганизацияПоУмолчанию = Параметр.НоваяОсновнаяОрганизация;
		
		Если ОрганизацияAzRyPay <> ПолучитьОрганизациюПоУмолчанию() Тогда
			Объект.AzRyKYCАнкетаКлиента.Очистить();
			Объект.AzRyОценкаРискаКлиента.Очистить();
			Объект.AzRyРискМатрицаКлиента.Очистить();
		КонецЕсли;
		
		Если НЕ Модифицированность Тогда
			Записать();
		КонецЕсли;
		//Оповестить("УстановкаОсновногоДоговораВыполнена");
		////Paganini_{
		//ОбновитьАдресИТелефонВОсновномДоговореКонтрагента();
		////}_Paganini
		
		Если ОрганизацияAzRyPay = ПолучитьОрганизациюПоУмолчанию() Тогда
			ЗаполнитьТаблицуВопросов("AzRyKYCАнкетаКлиента", "AzRyВопросыKYCАнкетыКлиента", "Вопрос");
			ЗаполнитьТаблицуВопросов("AzRyОценкаРискаКлиента", "AzRyKYCВопросыКлиента", "Вопрос");
			ЗаполнитьТаблицуВопросов("AzRyРискМатрицаКлиента", "AzRyФакторыРискаКлиента", "ФакторРиска");
			Модифицированность = Истина;
		КонецЕсли;		
		
		ОбновитьЭлементыФормы();
		
	КонецЕсли;
	
КонецПроцедуры



//&НаСервере
//Процедура ЗаполнитьТаблицуВопросов(ИмяТабличнойЧасти, ПеречислениеВопросовТекст)
//	
//	ПеречислениеВопросов = Перечисления[ПеречислениеВопросовТекст];
//	
//	ТаблицаВопросов = Объект[ИмяТабличнойЧасти];
//	
//	Для Каждого Вопрос Из ПеречислениеВопросов Цикл
//		
//		Если Не ВопросУжеЕсть(ТаблицаВопросов, Вопрос) Тогда
//			НоваяСтрока = ТаблицаВопросов.Добавить();
//			НоваяСтрока.Вопрос = Вопрос;
//		КонецЕсли;
//		
//	КонецЦикла;

//КонецПроцедуры

//&НаСервере
//Функция ВопросУжеЕсть(Таблица, Вопрос)

//	Для Каждого Стр Из Таблица Цикл
//		
//		Если Стр.Вопрос = Вопрос Тогда
//			Возврат Истина;
//		КонецЕсли;
//		
//	КонецЦикла;

//	Возврат Ложь;

//КонецФункции

#КонецОбласти
